goldsail/ESD_1506/VoiceRecorder/Workspace/Voice_Recorder_1506.cydsn/Generated_Source/PSoC5/ADC_1506.c
    /* Initialize the registers with default customizer settings for config1 */
    ADC_1506_InitConfig(ADC_1506_Config);
}


/******************************************************************************
* Function Name: ADC_1506_Enable
*******************************************************************************
*
* Summary:
*  Enables the ADC DelSig block operation.
*
*
* Parameters:
*  None
*
* Return:
*  None
*
*******************************************************************************/
void ADC_1506_Enable(void) 
{
	uint8 config;
    uint8 enableInterrupts;
    enableInterrupts = CyEnterCriticalSection();

    /* Read volatile variable to the local variable */
    config = ADC_1506_Config;
    
    /* Enable active mode power for ADC */
    ADC_1506_PWRMGR_DEC_REG |= ADC_1506_ACT_PWR_DEC_EN;
    ADC_1506_PWRMGR_DSM_REG |= ADC_1506_ACT_PWR_DSM_EN;

     /* Enable alternative active mode power for ADC */
    ADC_1506_STBY_PWRMGR_DEC_REG |= ADC_1506_STBY_PWR_DEC_EN;
    ADC_1506_STBY_PWRMGR_DSM_REG |= ADC_1506_STBY_PWR_DSM_EN;

    /* Disable PRES, Enable power to VCMBUF0, REFBUF0 and REFBUF1, enable PRES */
    ADC_1506_RESET_CR4_REG |= ADC_1506_IGNORE_PRESA1;
    ADC_1506_RESET_CR5_REG |= ADC_1506_IGNORE_PRESA2;

    ADC_1506_DSM_CR17_REG |= (ADC_1506_DSM_EN_BUF_VREF | ADC_1506_DSM_EN_BUF_VCM);

    /* Code to disable the REFBUF0 if reference chosen is External ref */
    #if (((ADC_1506_CFG1_REFERENCE == ADC_1506_EXT_REF_ON_P03) || \
          (ADC_1506_CFG1_REFERENCE == ADC_1506_EXT_REF_ON_P32)) || \
         ((ADC_1506_DEFAULT_NUM_CONFIGS > 1) && \
          ((ADC_1506_CFG2_REFERENCE == ADC_1506_EXT_REF_ON_P03) ||  \
           (ADC_1506_CFG2_REFERENCE == ADC_1506_EXT_REF_ON_P32))) || \
         ((ADC_1506_DEFAULT_NUM_CONFIGS > 2) && \
          ((ADC_1506_CFG3_REFERENCE == ADC_1506_EXT_REF_ON_P03) ||  \
           (ADC_1506_CFG3_REFERENCE == ADC_1506_EXT_REF_ON_P32))) || \
         ((ADC_1506_DEFAULT_NUM_CONFIGS > 3) && \
          ((ADC_1506_CFG4_REFERENCE == ADC_1506_EXT_REF_ON_P03) || \
           (ADC_1506_CFG4_REFERENCE == ADC_1506_EXT_REF_ON_P32))))
        if (((config == 1u) &&
            ((ADC_1506_CFG1_REFERENCE == ADC_1506_EXT_REF_ON_P03) ||
             (ADC_1506_CFG1_REFERENCE == ADC_1506_EXT_REF_ON_P32))) ||
            ((config == 2u) &&
            ((ADC_1506_CFG2_REFERENCE == ADC_1506_EXT_REF_ON_P03) ||
             (ADC_1506_CFG2_REFERENCE == ADC_1506_EXT_REF_ON_P32))) ||
            ((config == 3u) &&
            ((ADC_1506_CFG3_REFERENCE == ADC_1506_EXT_REF_ON_P03) ||
             (ADC_1506_CFG3_REFERENCE == ADC_1506_EXT_REF_ON_P32))) ||
            ((config == 4u) &&
            ((ADC_1506_CFG4_REFERENCE == ADC_1506_EXT_REF_ON_P03) ||
             (ADC_1506_CFG4_REFERENCE == ADC_1506_EXT_REF_ON_P32))))
        {
            /* Disable the REFBUF0 */
            ADC_1506_DSM_CR17_REG &= (uint8)~ADC_1506_DSM_EN_BUF_VREF;
        }
    #endif /* External ref */

    #if (((ADC_1506_CFG1_INPUT_RANGE == ADC_1506_IR_VSSA_TO_2VREF) || \
         ((ADC_1506_DEFAULT_NUM_CONFIGS > 1) && \
          (ADC_1506_CFG2_INPUT_RANGE == ADC_1506_IR_VSSA_TO_2VREF)) || \
         ((ADC_1506_DEFAULT_NUM_CONFIGS > 2) && \
          (ADC_1506_CFG3_INPUT_RANGE == ADC_1506_IR_VSSA_TO_2VREF)) || \
         ((ADC_1506_DEFAULT_NUM_CONFIGS > 3) && \
          (ADC_1506_CFG4_INPUT_RANGE == ADC_1506_IR_VSSA_TO_2VREF))))
        if(((config == 1u) &&
            (ADC_1506_CFG1_INPUT_RANGE == ADC_1506_IR_VSSA_TO_2VREF) &&
            ((ADC_1506_CFG1_REFERENCE != ADC_1506_EXT_REF_ON_P03) &&
             (ADC_1506_CFG1_REFERENCE != ADC_1506_EXT_REF_ON_P32))) ||
             ((config == 2u) &&
              (ADC_1506_CFG2_INPUT_RANGE == ADC_1506_IR_VSSA_TO_2VREF) &&
             ((ADC_1506_CFG2_REFERENCE != ADC_1506_EXT_REF_ON_P03) &&
             (ADC_1506_CFG2_REFERENCE != ADC_1506_EXT_REF_ON_P32))) ||
             ((config == 3u) &&
              (ADC_1506_CFG3_INPUT_RANGE == ADC_1506_IR_VSSA_TO_2VREF) &&
             ((ADC_1506_CFG3_REFERENCE != ADC_1506_EXT_REF_ON_P03) &&
             (ADC_1506_CFG3_REFERENCE != ADC_1506_EXT_REF_ON_P32))) ||
             ((config == 4u) &&
              (ADC_1506_CFG4_INPUT_RANGE == ADC_1506_IR_VSSA_TO_2VREF) &&
             ((ADC_1506_CFG4_REFERENCE != ADC_1506_EXT_REF_ON_P03) &&
             (ADC_1506_CFG4_REFERENCE != ADC_1506_EXT_REF_ON_P32))))
        {
            /* Enable the REFBUF1 */
            ADC_1506_DSM_REF0_REG |= ADC_1506_DSM_EN_BUF_VREF_INN;
        }
    #endif /* VSSA_TO_2VREF */
    if(config != 0u)
    {
        /* Suppress compiler warning */
    }

    /* Wait for 3 microseconds */
    CyDelayUs(ADC_1506_PRES_DELAY_TIME);

    /* Enable the press circuit */
    ADC_1506_RESET_CR4_REG &= (uint8)~ADC_1506_IGNORE_PRESA1;
    ADC_1506_RESET_CR5_REG &= (uint8)~ADC_1506_IGNORE_PRESA2;

    /* Enable negative pumps for DSM  */
    ADC_1506_PUMP_CR1_REG  |= ( ADC_1506_PUMP_CR1_CLKSEL | ADC_1506_PUMP_CR1_FORCE );

    /* Enable Modulator Chopping if required */
    ADC_1506_DSM_CR2_REG = ADC_1506_CFG1_DSM_CR2;

    /* This is only valid if there is an internal clock */
    #if(ADC_1506_DEFAULT_INTERNAL_CLK)
        ADC_1506_PWRMGR_CLK_REG |= ADC_1506_ACT_PWR_CLK_EN;
        ADC_1506_STBY_PWRMGR_CLK_REG |= ADC_1506_STBY_PWR_CLK_EN;
    #endif /* ADC_1506_DEFAULT_INTERNAL_CLK */

    /* Enable the active and alternate active power for charge pump clock */
    ADC_1506_PWRMGR_CHARGE_PUMP_CLK_REG |= ADC_1506_ACT_PWR_CHARGE_PUMP_CLK_EN;
    ADC_1506_STBY_PWRMGR_CHARGE_PUMP_CLK_REG |= ADC_1506_STBY_PWR_CHARGE_PUMP_CLK_EN;

    #if(ADC_1506_IRQ_REMOVE == 0u)
        /* Clear a pending interrupt */
        CyIntClearPending(ADC_1506_INTC_NUMBER);
        /* Enable interrupt */
        CyIntEnable(ADC_1506_INTC_NUMBER);
    #endif   /* End ADC_1506_IRQ_REMOVE */

    CyExitCriticalSection(enableInterrupts);

}


/*******************************************************************************
* Function Name: ADC_1506_Start
********************************************************************************
*
* Summary:
*  Performs all required initialization for this component and enables
*  the power. It configure all the register the first time it is called.
*  Subsequent calls of the Start function only enable the ADC and turn
*  on the power. If multiple configurations are selected, it will
*  configure the ADC for configuration 1 by default, unless the
*  ADC_1506_SelectConfiguration( ) function has been called to change
*  the default setting.
*
* Parameters:
*  None
*
* Return:
*  None
*
* Global variables:
*  ADC_1506_initVar:  Used to check the initial configuration,
*  modified when this function is called for the first time.
*
*******************************************************************************/
void ADC_1506_Start(void) 
{
    if(ADC_1506_initVar == 0u)
    {
        if(ADC_1506_started == 0u)
        {
            ADC_1506_Init();
        }
        ADC_1506_initVar = 1u;
    }

    /* Enable the ADC */
    ADC_1506_Enable();
}


