goldsail/ESD_1506/VoiceRecorder/Workspace/Voice_Recorder_1506.cydsn/Generated_Source/PSoC5/ADC_1506.c
    }
    return(status);
}


/******************************************************************************
* Function Name: ADC_1506_ReadGCOR
*******************************************************************************
*
* Summary:
*  This API returns the current GCOR register value, normalized based on the
*  GVAL register settings.
*  For example, if the GCOR value is 0x0812 and the GVAL register is set to 
*  11 (0x0B) then the returned value will be shifted by for bits to the left.
*  (Actual GCOR value = 0x0812, returned value = 0x8120)
*
* Parameters:
*  None
*
* Return:
*  uint16:  Normalized GCOR value.
*
*******************************************************************************/
uint16 ADC_1506_ReadGCOR(void) 
{
    uint8 gValue;
    uint16 gcorValue;

    gValue = ADC_1506_DEC_GVAL_REG;
    gcorValue = CY_GET_REG16(ADC_1506_DEC_GCOR_16B_PTR);

    if (gValue < ADC_1506_MAX_GVAL)
    {
        gcorValue <<= ADC_1506_MAX_GVAL - gValue;
    }

    return gcorValue;
}


/*******************************************************************************
* Function Name: ADC_1506_StartConvert
********************************************************************************
*
* Summary:
*  Forces the ADC to initiate a conversion. If in the "Single Sample"
*  mode, one conversion will be performed then the ADC will halt. If in
*  one of the other three conversion modes, the ADC will run
*  continuously until the ADC_Stop() or ADC_StopConvert() is called.
*
* Parameters:
*  None
*
* Return:
*  None
*
*******************************************************************************/
void ADC_1506_StartConvert(void) 
{
    /* Start the conversion */
    ADC_1506_DEC_CR_REG |= ADC_1506_DEC_START_CONV;
}


/*******************************************************************************
* Function Name: ADC_1506_StopConvert
********************************************************************************
*
* Summary:
*  Forces the ADC to stop all conversions. If the ADC is in the middle of a
*  conversion, the ADC will be reset and not provide a result for that partial
*  conversion.
*
* Parameters:
*  None
*
* Return:
*  None
*
*******************************************************************************/
void ADC_1506_StopConvert(void) 
{
    /* Stop all conversions */
    ADC_1506_DEC_CR_REG &= (uint8)~ADC_1506_DEC_START_CONV;
}


/*******************************************************************************
* Function Name: ADC_1506_IsEndConversion
********************************************************************************
*
* Summary:
*  Checks the status that the most recently started conversion has completed.
*  The status is cleared by any of ADC_GetResult8(), ADC_GetResult16() or 
*  ADC_GetResult32() API.
*  This function provides the programmer with two options. In one mode this 
*  function immediately returns with the conversion status. In the other mode,
*  the function does not return (blocking) until the conversion has completed.
*
* Parameters:
*  retMode: Check conversion return mode. See the following table for options.
*   ADC_1506_RETURN_STATUS -   Immediately returns conversion result
*                                      status.
*   ADC_1506_WAIT_FOR_RESULT - Does not return until ADC conversion
*                                      is complete.
*
* Return:
*  If a nonzero value is returned, the last conversion has completed.
*  If the returned value is zero, the ADC is still calculating the last result.
*
* Global variables:
*  ADC_1506_convDone:  Used to check whether conversion is complete
*  or not for single sample mode with resolution is above 16
*
*******************************************************************************/
uint8 ADC_1506_IsEndConversion(uint8 retMode) 
{
    uint8 status;

    do
    {
        /* Check for stop convert if conversion mode is Single Sample with
        *   resolution above 16 bit
        */
        if(ADC_1506_stopConversion != 0u)
        {
            status = ADC_1506_convDone;
        }
        else
        {
            status = ADC_1506_DEC_SR_REG & ADC_1506_DEC_CONV_DONE;
        }
    }while((status != ADC_1506_DEC_CONV_DONE) && (retMode == ADC_1506_WAIT_FOR_RESULT));

    return(status);
}


/*******************************************************************************
* Function Name: ADC_1506_GetResult8
********************************************************************************
*
* Summary:
*  This function returns the result of an 8-bit conversion. If the
*  resolution is set greater than 8-bits, the LSB of the result will be
*  returned. When the ADC is configured for 8-bit single ended mode,
*  the ADC_GetResult16() function should be used instead. This
*  function returns only signed 8-bit values. The maximum positive
*  signed 8-bit value is 127, but in singled ended 8-bit mode, the
*  maximum positive value is 255.
*
* Parameters:
*  None
*
* Return:
*  int8: The LSB of the last ADC conversion.
*
* Global variables:
*  ADC_1506_convDone:  Cleared in single sample mode with resolution
*                              above 16 bits
*
*******************************************************************************/
int8 ADC_1506_GetResult8( void ) 
{
    int8 result;
    uint8 coherency;

    /* Read active coherency configuration */
    coherency = ADC_1506_DEC_COHER_REG & ADC_1506_DEC_SAMP_KEY_MASK;

    result = (int8)ADC_1506_DEC_SAMP_REG;

    if(coherency == ADC_1506_DEC_SAMP_KEY_MID)
    {   /* Dummy read of the middle byte to unlock the coherency */
        (void)ADC_1506_DEC_SAMPM_REG;
    }
    else  if(coherency == ADC_1506_DEC_SAMP_KEY_HIGH)
    {   /* Dummy read of the MSB byte to unlock the coherency */
        (void)ADC_1506_DEC_SAMPH_REG;
    }
    else /*No action required for other coherency */
    {
    }
    /* Clear conversion complete status in Single Sample mode with resolution above 16 bit */
    if(ADC_1506_stopConversion != 0u)
    {
        ADC_1506_convDone = 0u;
    }
    return (result);
}


